var local_database = [
    {
        title: "进击的巨人",
        content: "《进击的巨人》（进撃の巨人），是日本漫画家谏山创创作的少年漫画作品，于2009年在讲谈社旗下的漫画杂志《别册少年Magazine》上开始连载。",
        imgSrc: "/images/postsImg/juren.jpg",
        reading: 62,
        detail: "107年前（743年），世界上突然出现了人类的天敌“巨人”。面临着生存危机而残存下来的人类逃到了一个地方，盖起了三重巨大的城墙。人们在这隔绝的环境里享受了一百多年的和平，直到艾伦·耶格尔十岁那年，60米高的“超大型巨人”突然出现，以压倒性的力量破坏城门，其后瞬间消失，凶残的巨人们成群的冲进墙内捕食人类。艾伦亲眼看着人们以及自己的母亲被巨人吞食，怀着对巨人无法形容的憎恨和痛恨，誓言杀死所有巨人。城墙崩坏的两年后，艾伦加入104期训练兵团学习和巨人战斗的技术。在训练兵团的三年，艾伦在同期训练兵里有着其他人无法比拟的强悍精神力。即使亲眼见过地狱也依然勇敢地向巨人挑战的艾伦，如愿以偿加入了向往已久的调查兵团。在他正做着到墙壁的外面去这个梦的时候，毁坏墙壁的超大巨人出现了。",
        collection: 92,
        dateTime: "24小时前",
        author: "谏山创",
        date: "Jan 23 2017",
        avatar: "/images/postsImg/post_icon.jpg",
    },
    {
        title: "一拳超人",
        content: "《一拳超人》是由ONE原作、村田雄介作画，连载于网络漫画杂志《Young jump next》上的漫画。[1-2]  原为ONE在个人网站上连载的练笔之作，[3]  后被喜爱该作的另一漫画家村田雄介，在征得ONE同意后重新绘制而成。至2016年11月27日，重制版日文单行销量累计突破1111万部。",
        imgSrc: "/images/postsImg/yiquan.jpg",
        reading: 87,
        detail: "《一拳超人》讲述的是主人公埼玉原本是一名整日奔波于求职的普通人。3年之前的一天偶然遇到了要对淘气少年下杀手的异变螃蟹人后，回忆起年少年时“想要成为英雄”的梦想，最终拼尽全力救下了淘气少年。重拾对于成为英雄的兴趣之后，通过拼命锻炼，埼玉终于脱胎换骨获得了最强的力量，但同时失去了头发成了光头，似乎还失去了某些感情。在独自做了一段时间英雄后，与弟子杰诺斯一起，正式加入英雄协会，与众多英雄一起开始了对抗各种怪人以及灾难的生活。不过经常是在无人知晓的情况下做英雄的工作。",
        collection: 54,
        dateTime: "24小时前",
        author: "村田雄介",
        date: "May 16 2015",
        avatar: "/images/postsImg/post_icon.jpg",
    },
    {
        title: "东京喰种",
        content: "《东京食尸鬼》是由石田スイ作画的漫画，连载于集英社杂志《YOUNG JUMP》[1]  。中文版由尖端出版代理。漫画《东京食尸鬼》于2014年9月17日完结，续作《东京食尸鬼：re》已于2014年10月11日开始连载。",
        imgSrc: "/images/postsImg/shizhong.jpg",
        reading: 21,
        detail: "在纷乱嘈杂的现代化城市——东京，蔓延着一种吞食人类的怪物，人们称之为喰种。他们外表与人几乎没有差异，但却只以人类为食，是人类的天敌。那一日，金木研——上井大学的一名普通学生——遇上了某位神秘女子神代利世小姐（实为喰种），进而卷入了一场精心策划的事故。自此，被改造为半人半喰种，一度感到孤独无助的他却被“古董”（动画版译作“安定区”）咖啡店的喰种收留，但好景不长，喰种组织“青铜树”很快找到了他并被带走承受酷刑，最终明白“软弱即是罪恶”，并决意变强，从此走上了另一条路。",
        collection: 39,
        dateTime: "24小时前",
        author: "石田スイ",
        date: "Nov 20 2016",
        avatar: "/images/postsImg/post_icon.jpg",
    }
]

module.exports = {
    postsList: local_database
}